Revit 2026 API

# SchemaBuilderAcceptableName Method

---

Checks whether a string is an acceptable name for a Schema or a Field.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AcceptableName(
	string name
)
```
```vb
Public Function AcceptableName (
	name As String
) As Boolean
```
```cpp
public:
bool AcceptableName(
	String^ name
)
```
```fsharp
member AcceptableName :
        name : string -> bool
```

#### Parameters

name String
     The string to check.

#### Return Value

Boolean True if the name is acceptable.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

For interoperability, names are required to be usable as C++ identifiers. The allowable characters are ASCII letters, numbers (except the first character) and underscore. The length must be between 1 and 247 characters.

#### Reference

SchemaBuilder Class

Autodesk.Revit.DB.ExtensibleStorage Namespace